#pragma once

//*****************************************************************************
// CharControllerクラス
// ゲームキャラクターとしての移動を司る
//*****************************************************************************

//*****************************************************************************
// 定数定義
//*****************************************************************************

#define ACCEL_LEFT  -1.0f
#define ACCEL_RIGHT  1.0f
#define CHAR_GRAVITY  1.0f

//*****************************************************************************
// 列挙型定義
//*****************************************************************************

enum {
	DIR_DOWN,
	DIR_LEFT,
	DIR_RIGHT,
	DIR_UP
};

//*****************************************************************************
// 構造体定義　→　このクラスに必要な変数セット
//*****************************************************************************

struct CharController {

	bool isActive;// 有効無効
	int direction;// 方向
	float moveSpeedX, moveSpeedY;// 移動速度XY
	float maxMoveSpeedX;// 最大移動速度
	float accelForceX;// 加速度X
	float stopForceX;// 停止力X　→　摩擦力的なもの

};

//*****************************************************************************
// クラス関数のプロトタイプ宣言
//*****************************************************************************

// 構造体（必要な変数セット）の初期化
void CharController_Initialize(CharController* pThis);

// 毎フレーム呼び出して、渡されたXY座標を加速度付き移動させる
void CharController_Update(CharController* pThis, float* pPosX, float* pPosY);

// X軸方向について、速度を加速させる
void CharController_Accelerate(CharController* pThis, float directionX);
